function displayPictureDetails(image) {
    // const gallery = document.getElementById("gallery");
    const pictureDetails = document.getElementById("pictureDetails");
    const selectedPicture = document.getElementById("selectedPicture");
    const pictureName = document.getElementById("pictureName");
    const pictureSize = document.getElementById("pictureSize");
    const pictured = document.getElementById("pictured");
    const credit = document.getElementById("cd");
    const file = image.getAttribute("src");
    if (pictureDetails.style.display === "table" && selectedPicture.src === file) {
        pictureDetails.style.display = "none";
        
    }else{
        
        selectedPicture.src = file;
        pictureName.textContent = "ชื่อ: " + image.alt;
        pictureSize.textContent = "ข้อมูลทั่วไป: " + getFileDetail(file);
        pictured.textContent = "สรรพคุณ: " + getsubpakun(file);
        credit.textContent = "Cr. " + creditt(file);
        pictureDetails.style.display = "table";
        pictureDetails.scrollIntoView({ behavior: "smooth" });
    }
}
  
function getFileDetail(file) {
    const filename = file.split('/').pop();
    if(filename == 'ถั่วดินโคก.jpg'){
        return "ชื่ออื่นๆ แผ่นดินเย็น (อุบลราชธานี) นมราชสีห์ นมฤๅษี ถั่วดินโคก เป็นพืชในวงศ์ Fabaceae เป็นไม้พุ่มขนาดเล็ก ลำต้นสั้นมาก";
    }else if (filename == 'เทพทาโร.jpg') {
        return "การบูร จะไคหอม จะไคต้น จวงหอม จวง พลูต้นขาว มือแดกะมางิง ไม้ยืนต้นขนาดกลาง - ใหญ่ สูงประมาณ 10 - 30 ม.";
    }else if(filename == 'มะตูมนิ่ม.jpg'){
        return "ลักษณะผลคล้ายมะตูมทั่วไปนิยมปลูกในบริเวณบ้านเพื่อเป็นยาเพียงอย่างเดียว มีสรรพคุณดีหลายอย่าง และที่ถือว่าเป็นสุดยอด";
    }else if(filename == 'มะหาด.jpg'){
        return "ชื่ออื่นๆหาด (ทั่วไป) มะหาดใบใหญ่ (ตรัง) หาดขนุน ปวกหาด (เหนือ) ขนุนป่า ไม้ยืนต้นขนาดใหญ่ สูง 15-25 เมตร ไม่ผลัดใบ ทรงพุ่มกลม ลำต้นเปลาตรง เปลือกต้นสีน้ำตาลอมแดงถึงน้ำตาลเข้ม ต้นแก่ผิวจะหยาบและแตกเป็นสะเก็ดเล็กๆ"
        +"ยอดอ่อนมีขนสีน้ำตาลออกแดงหนาแน่นมีน้ำยางสีขาว";
    }else if(filename == 'เร่ว.jpg'){
        return "เร่วมี2ประเภทคือ เร่วน้อย ผลค่อนข้างกลม ลักษณะเป็น 3 พูมีขน ผลแก่สีน้ำตาลแดง มีเมล็ดจำนวนมากจับกันเป็นกลุ่มก้อนกลม   หรือกลมรี มี 3 พู แต่ละพูมีเมล็ด 3-15 เมล็ด"+
        "เมล็ดแข็ง เนื้อในเมล็ดสีขาวอมเหลือง กลิ่นหอมฉุน รสเผ็ดซ่าและขมเล็กน้อย เร่วใหญ่ ผลเรียวยาวหรือขอบขนานแกมสามเหลี่ยม มีขนอ่อนสีน้ำตาลแดงปกคลุม ภายในมีเมล็ดเป็นกลุ่ม 10-20 เมล็ด ลักษณะเหมือนเร่วน้อย ผลมีรสมันเฝื่อนติดเปรี้ยว เมล็ด รสร้อนเผ็ดปร่า";
    }else if(filename == 'หัวร้อยรู.jpg'){
        return "ป็นพืชจำพวกหัว ที่อาศัยเกาะตามต้นไม้อื่น ต้นแก่มีหัวกลมโตขนาดเท่าลูกมะพร้าวห้าว ภายในหัวเป็นรูย้อนขึ้น ย้อนลง พรุนไปทั่ว เมื่อผ่าออกดู มักมีมดดำอาศัยอยู่เต็มหัว"
        +"ต้องนำมาแช่น้ำทิ้งไว้จนกว่ามดจะออกไปหมด เนื้อนิ่ม สีน้ำตาลไหม้ มักขึ้นตามคาคบไม้ หัวมีรสเมา";
    }else if(filename == 'กระทุ่มนา.jpg'){
        return "เป็นไม้ยืนต้นขนาดกลาง - ใหญ่ ทรงพุ่มกลมคล้ายเห็ดใกล้บาน แตกกิ่งก้านมากตั้งแต่โคนต้น";
    }else if(filename == 'ขันทองพยาบาท.jpg'){
        return "เป็นไม้ยืนต้นขนาดกลาง สูง 7-13 เมตร ทรงพุ่มแน่นทึบ ลำต้นตรง กิ่งก้านอ่อน กิ่งห้อยลง กิ่งมีขนรูปดาว เปลือกต้นสีน้ำตาลแก่ ผิวบางเรียบ เนื้อไม้สีขาว";
    }else if(filename == 'จุกโรหินี.jpg'){
        return "หรือ บวบลม มีลักษณะเป็นใบเดี่ยวเรียงตรงข้ามกันเป็นคู่ หรือออกใบเดียว ผิวเรียบ ใบอวบน้ำ มีรูปร่างคล้ายถุง กว้าง 2-2.5 เซนติเมตร ยาว 5-12 เซนติเมตร จะแบนเป็นเหลี่ยม ด้านนอกมีสีเขียว ด้านในมีสีม่วง ทั้งต้นมีรสฝาด สุขุม";
    }else if(filename == 'ชะเอมไทย.jpg'){
        return "มีลักษณะเป็นไม้เถายืนต้นขนาดกลาง สูง 5-8 เมตร มีหนามตามลำต้นและกิ่งก้าน เปลือกนอกสีน้ำตาลอมเทา ใบเล็กละเอียดเป็นฝอย เป็นใบประกอบแบบขนนก 2 ชั้น ยาว 10-15 เซนติเมตร เรียงสลับ"
        +"ดอกออกเป็นช่อที่ปลายกิ่ง ช่อดอกแบบช่อแยกแขนง ลักษณะเป็นพู่ กลีบดอกสีขาว มีกลิ่นหอม ผลเป็นฝัก แบน ปลายแหลม";
    }else if(filename == 'ชิงชี่.jpg'){
        return "มีลักษณะเป็น ม้พุ่มหรือกึ่งเลื้อย สูง 2-6 เมตร กิ่งก้านอ่อนมีสีเขียว ผิวเรียบเกลี้ยง กิ่งคดไปมา มีหนามยาว 2-4 มิลลิเมตร ตรงหรือโค้งเล็กน้อย ลำต้นสีเทา ผิวเปลือกเป็นกระสีขาว แตกระแหง"
        +"ใบเป็นใบเดี่ยว เรียงสลับ รูปขอบขนาน รูปรี";
    }else if(filename == 'ตับเต่า.jpg'){
        return "หรือ มะพลับดง มีลักษณะเป็น ไม้ยืนต้นผลัดใบขนาดเล็กถึงขนาดกลาง มีความสูงของต้นประมาณ 10-15 เมตร ทรงพุ่มโปร่งเป็นรูปกรวย เปลือกต้นเป็นสีน้ำตาลปนเทาหรือสีเทาอมขาว ส่วนเปลือกด้านในเป็นสีน้ำตาลอมแดง";
    }else if(filename == 'นางเเย้มป่า.jpg'){
        return "จัดเป็นไม้พุ่มขนาดย่อม มีความสูงของต้นประมาณ 0.5-4 เมตร ลำต้นตั้งเป็นสันสี่เหลี่ยมตรงแต่ไม่มีขนปกคลุม กิ่งอ่อน และต้นเปราะ กิ่งอ่อนเป็นสีแดง หรือ สีดำอมน้ำตาล ใบเป็นใบเดี่ยว";
    }else if(filename == 'ปลาไหลเผือก.jpg'){
        return "มีลักษณะเป็น  รากกลมโต สีขาว สีขาวนวล รากที่มีอายุหลายปีจะมีความยาวมาก อาจยาวมากกว่า 2 เมตร รากมีรสขม  เบื่อเมาเล็กน้อย";
    }else if(filename == 'พังคี.jpg'){
        return "หรือ เจตพังคี มีลักษณะเป็น ไม้พุ่มขนาดเล็ก สูงประมาณ 20-40 เซนติเมตร มีรากขนาดใหญ่ใต้ดิน เปลือกรากหลุดออกง่าย มีกลิ่นหอม ใบเดี่ยวเรียงสลับ รูปวงรีหรือรูปไข่แกมรูปหอก";
    }else if(filename == 'มะคังแดง.jpg'){
        return "มีลักษณะเป็น ไม้ยืนต้น กึ่งไม้พุ่ม ขนาดกลาง สูง 6-12 เมตร ใบดกหนาทึบ ลำต้นและกิ่งก้านสีน้ำตาลแดง มีขนนุ่มๆ สีน้ำตาลแดงปกคลุมทั่วไป โคนต้นและกิ่งมีหนามโดยรอบ"
        +"หนามขนาดใหญ่ พุ่งตรงออกเป็นระยะ ใบเดี่ยว เรียงตรงข้าม รูปวงรีหรือรูปไข่กลับ ผิวใบมีขนทั้งสองด้าน มีหูใบอยู่ระหว่างก้านใบ โคนใบมน หลังใบเรียบ ท้องใบมีขนสีขาวปกคลุม ขอบใบเรียบ ก้านใบมีขนสีขาว มีหูใบเป็นรูปสามเหลี่ยมหลุดร่วงง่าย ดอกช่อขนาดเล็กออกเป็นช่อสั้น ที่ซอกใบใกล้ปลายกิ่ง ดอกย่อยสีเขียวอ่อน กลีบดอกมี 5 กลีบ  โคนกลีบดอกติดกัน";
    }else if(filename == 'สะค้าน.jpg'){
        return "มีลักษณะเป็น เถาแห้งสีน้ำตาล ทรงกระบอก ผิวขรุขระ มีข้อปล้อง หน้าตัดตามขวงมีลายเส้นเป็นแนวรัศมี เปลือกค่อนข้างอ่อน เนื้อสีเหลืองน้ำตาล มีรากฝอยติดอยู่ตามข้อ มีกลิ่นหอมเฉพาะ รสเผ็ดร้อน";
    }else if(filename == 'สารภีป่า.jpg'){
        return "มีลักษณะเป็น ไม้ยืนต้นขนาดเล็กถึงขนาดกลาง ไม่ผลัดใบ สูงถึง 25 เมตร ลำต้นคดงอ แตกกิ่งต่ำ เปลือกต้นเรียบหรือแตกเป็นร่องตื้นไม่เป็นระเบียบ อาจมีรอยแตกลึกเป็นลวดลายละเอียด บางครั้งเปลือก"
        +"สีครีมค่อนข้างเรียบ เปลือกในสีแดงปนน้ำตาล ใบเดี่ยว เรียงเวียน ดอกเดี่ยว ขนาด 3-4 เซนติเมตร ออกเป็นกลุ่มใกล้ปลายกิ่ง ชี้ลงดิน ผลค่อนข้างกลม รูประฆัง ผิวเรียบ มีเนื้อหนา คล้ายหนัง";
    }else if(filename == 'อบเชยไทย.jpg'){
        return "อบเชยเป็นเครื่องยา และเครื่องเทศ ที่ได้จากการขูดเอาเปลือกชั้นนอกออกให้หมด  แล้วลอกเปลือกชั้นในออกจากแก่นลำต้น โดยใช้มีดกรีดตามยาวของกิ่ง แล้วรวบรวมนำไปผึ่งที่ร่มสลับกับการนำออก"
        +"ตากแดดประมาณ 5 วัน  ขณะตากใช้มือม้วนขอบทั้งสองข้างเข้าหากัน  จนเปลือกแห้งจึงมัดรวมกัน เปลือกอบเชยที่ดีจะมีสีน้ำตาลอ่อน(สีสนิม) มีความตรงและบางสม่ำเสมอ ยาวประมาณ 1 เมตร มีกลิ่นหอมเฉพาะ"
        +"รสสุขุม เผ็ด หวานเล็กน้อย";
    }else if(filename == 'เฉียงพร้านางแอ.jpg'){
        return "มีลักษณะเป็น ไม้ยืนต้นขนาดกลางถึงขนาดใหญ่ สูง 25-30 เมตร ไม่ผลัดใบ ลำต้นตั้งตรง เปลือกสีน้ำตาลอมแดงถึงน้ำตาลอมเทา ผิวเรียบ มีรูอากาศมาก ใบเดี่ยว เรียงตรงข้ามสลับตั้งฉาก"
        +"ดอกช่อแยกแขนง ออกที่ซอกใบหรือปลายกิ่ง แตกแขนงเป็น 4 กิ่ง ผลสดแบบมีเนื้อ รูปทรงกลม ขนาดเล็ก ออกเป็นกระจุก เมล็ดรูปไตสีน้ำตาลเข้มหรือดำ";
    }else if(filename == 'เถาเอ็นอ่อน.jpg'){
        return "มีลักษณะเป็น ไม้เถา เนื้อแข็ง เถากลม เปลือกเถาเรียบ เปลือกมีผิวบางๆสีแดงเข้มหุ้มอยู่ เถาแก่เปลือกหนาสีดำ เมื่อเถาแก่เปลือกจะหลุดลอกออกเป็นแผ่น มียางสีขาวข้นทั้งต้น รสขมเบื่อมัน";
    }else if(filename == 'เปราะหอม.jpg'){
        return "มีลักษณะเป็น มีเหง้าสั้น ขนาดเล็ก เหง้าหลักทรงกลมผิวสีน้ำตาลอ่อน ที่ผิวมีรอยข้อปล้องชัดเจน ออกรากจากเหง้าหลักเป็นเส้นกลมยาว คล้ายกระชายเนื้อภายในเหง้าเมื่ออบแห้งแล้วมีสีขาว"
        +"หรือสีเหลืองอ่อนๆ มีกลิ่นหอมเฉพาะตัว เหง้าใต้ดิน รสผ็ดขม มีกลิ่นหอม";
    }
    
}
function getsubpakun(file){
    const filename = file.split('/').pop();
    if(filename == 'ถั่วดินโคก.jpg'){
        return "ยาสมุนไพรพื้นบ้านจังหวัดอุบลราชธานี  ใช้  ราก ฝนกับน้ำดื่ม ช่วยลดไข้ในเด็ก ฝนทาแก้พิษงู(ต้องว่าคาถาด้วย) ต้มน้ำดื่ม บำรุงน้ำนม (กินมากไม่ดี) ราก เหง้า ลำต้น ใบ ฝนทาฝี"
        +"ยาพื้นบ้านอีสาน  ใช้  ราก ฝนน้ำทา แก้ฝี";
    }else if (filename == 'เทพทาโร.jpg') {
        return "เป็นพันธุ์ไม้ที่มีความหอมในทุกๆ ส่วน ตั้งแต่ใบ ดอก ลำต้น ราก ใบ เรียกว่า ใบกระจาน ใช้ทำเครื่องเทศ ขับลม บำรุงธาตุ แก้ท้องอืดท้องเฟ้อ"
        +"เนื้อไม้ แก้ลมจุกเสียด แน่นเฟ้อ ขับลมในกระเพาะอาหารและลำไส้ แก้ปวดท้อง";
    }else if(filename == 'มะตูมนิ่ม.jpg'){
        return "ผลสดสุกมีรสฝาดหวานกินเป็นยาอายุวัฒนะ บำรุงกำลัง ช่วยให้เจริญอาหาร ขับผายลมดีมากโดยให้เอาผลสดสุก 1 ผล หรือ 2 ผล"
        +"ต้มกับน้ำท่วมยาจนเดือดดื่มต่างน้ำ หรือจะดื่มแทนน้ำชาก็ได้ ช่วยบำรุงกำลังได้เด็ดขาดมาก รากแก้พิษฝี พิษไข้ แก้สติเผลอ รักษาน้ำดี";
    }else if(filename == 'มะหาด.jpg'){
        return "นำแก่นไม้ที่อายุ 5 ปีขึ้นไป มาสับแล้วนำไปต้มเคี่ยวกับน้ำ จนเกิดฟอง ช้อนฟองที่ได้รวมกันทำให้แห้ง นำไปย่างไฟให้เหลือง แล้วนำมาบดเป็นผง"
        +"นำมาชงกับน้ำเย็นรับประทาน เป็นยาขับพยาธิตัวตืดและพยาธิไส้เดือน หรือใช้ละลายน้ำ ทาแก้ผื่นคัน เปลือกต้น รสฝาด ใช้เคี้ยวกับหมากแทนสีเสียด เปลือกต้นสด สมาน ทาขับพยาธิ"
        +"ต้มกินแก้ไข้ ขับพยาธิ ผลสุกรับประทานได้ รสหวานอมเปรี้ยว ราก แก้ไข้ ขับพิษร้อนใน ขับพยาธิ แก้กษัยในเส้นเอ็น";
    }else if(filename == 'เร่ว.jpg'){
        return "ผลเร่วน้อย รสร้อนเผ็ดปร่า แก้ไข้ แก้ริดสีดวง แก้หืดไอ เสมหะ แก้ระดูขาว แก้ไข้สันนิบาต เมล็ดเร่วน้อย รสร้อนเผ็ดปร่า ขับลมในลำไส้ แก้ท้องขึ้น อืดเฟ้อ ปวดท้อง แก้คลื่นเหียน"
        +"รสมันเฝื่อนติดเปรี้ยว แก้ไข้เพื่อดีและเสมหะ แก้ริดสีดวงทวาร เร่วใหญ่ รสร้อนเผ็ดปร่า ขับลม แก้ท้องอืดท้องเฟ้อ ขับน้ำนมหลังคลอด แก้ปวดท้อง"
        +"แก้คลื่นเหียนอาเจียน ลดไขมันในเลือดลดความเป็นพิษของสารพิษต่อตับ แก้ริดสีดวง หืดไอ  ขับเสมหะ แก้ความดันโลหิตต่ำ แก้ไข้สันนิบาต";
    }else if(filename == 'หัวร้อยรู.jpg'){
        return "หัวบำรุงหัวใจ ขับชีพจร ขับพยาธิ แก้พิษในข้อในกระดูก แก้พิษประดง แก้ข้อเข่าข้อเท้าบวม รักษามะเร็ง"
        +"หัวร้อยรู";
    }else if(filename == 'กระทุ่มนา.jpg'){
        return "ใบเมื่อเคี้ยวมีรสขม มีอัลคาลอยด์หลายชนิด ช่วยลดความดันโลหิตและออกฤทธิ์กดประสาทและกล้ามเนื้อในสัตว์ทดลอง"
        +"เปลือกต้นรสฝานร้อน รักษาโรคผิวหนังทุกชนิด แก้มะเร็งคุดทะราด แก้บิดมูกเลือด";
    }else if(filename == 'ขันทองพยาบาท.jpg'){
        return "รสเมาเบื่อร้อน แก้ลม แก้ประดง แก้พิษในกระดูก แก้โรคผิวหนัง รักษาน้ำเหลืองเสีย เปลือกต้น รสเมาเบื่อ แก้ปอดพิการ แก้ลมเป็นพิษ แก้โรคผิวหนัง รักษามะเร็ง เป็นยาถ่าย เป็นยาระบาย เป็นยาบำรุงเหงือก";
    }else if(filename == 'จุกโรหินี.jpg'){
        return "ใช้ทั้งต้น รสฝาดสุขุม ต้มน้ำดื่ม แก้ปวดท้อง เนื่องจากโรคกระเพาะอาหารอักเสบ ใบ รสฝาดสุขม ใช้เป็นยาฝาดสมาน แก้ท้องร่วง ราก รสฝาดสุขุม แก้ท้องร่วง แก้อาเจียน แก้บิด"
        +"ใช้ภายนอกเป็นยาสมานแผล รากนำมาเคี้ยวกับพลู เป็นยาแก้ไอ";
    }else if(filename == 'ชะเอมไทย.jpg'){
       return "ใช้ลำต้นเข้ากับเครือไส้ไก่ เครือหมาว้อ เครือตากวง ต้มน้ำดื่ม แก้โรคตับ เปลือกต้น ต้มน้ำดื่ม แก้ไอ รากช่วยแก้กระหาย ยาระบาย เนื้อไม้ บรรเทาอาการเจ็บคอ";
    }else if(filename == 'ชิงชี่.jpg'){
        return "ราก รสขมขื่น แก้โรคที่เกิดในท้อง ขับลมภายใน แก้ไข้ร้อนทุกชนิด ราก แก้ไข้ต่างๆ กระทุ้งพิษหรือถอนพิษต่างๆ"
        +"ทั้งต้น รสขื่นปร่า ตำพอกแก้ฟกช้ำ บวม แก้ไข้ ขับน้ำเหลืองเสีย ใบ รสเฝื่อนเมา เข้ายาอาบ แก้โรคผิวหนัง ดอก รสขื่นเมา แก้มะเร็ง ผลดิบ รสขื่นปร่า แก้โรคในลำคอ เจ็บคอ ลำคออักเสบ";
    }else if(filename == 'ตับเต่า.jpg'){
        return "เนื้อไม้และราก รสฝาดเลี่ยนเย็น สรรพคุณ แก้พิษทั้งปวง แก้พิษวัณโรค";
    }else if(filename == 'นางเเย้มป่า.jpg'){
        return "รากแห้ง มาต้มกับน้ำ ใช้แก้ลำไส้อักเสบ ไตพิการ ขับปัสสาวะ แก้ไข้ ขับระดูในสตรี แก้ปวดข้อ แก้เหน็บชา ทั้งต้น มาตากให้แห้ง แล้วนำมาต้มกับน้ำดื่ม ใช้แก้เริม งูสวัด";
    }else if(filename == 'ปลาไหลเผือก.jpg'){
        return "ใช้ ราก รสขม เบื่อเมาเล็กน้อย ถ่ายพิษต่างๆ ถ่ายฝีในท้อง ถ่ายพิษไข้พิษเสมหะ และโลหิต แก้ไข้ แก้ไข้มาลาเรีย ตัดไข้ทุกชนิด แก้ลม แก้วัณโรคระยะบวม"
        +"ขับเหงื่อ ขับพยาธิ แก้ต่อมทอนซิลอักเสบ แก้เจ็บคอ ความดันเลือดสูง อัมพาต ขับถ่ายน้ำเหลือง แก้ท้องผูก";
    }else if(filename == 'พังคี.jpg'){
        return "ใช้ราก ซึ่งมีรสเผ็ด ขื่น เฝื่อนเล็กน้อย และมีกลิ่นหอม แก้ท้องขึ้น ปวดแน่นท้อง หรือใช้ภายนอกโดยฝนกับน้ำปูนใส ผสมกับมหาหิงคุ์และการบูรทาท้องเด็กอ่อน ทำให้ผายลม";
    }else if(filename == 'มะคังแดง.jpg'){
        return "ใช้ ต้นต้มน้ำดื่ม แก้เลือดลมเดินไม่สะดวก ผสมกับหัวยาข้าวเย็น ต้มน้ำดื่มแก้ไตพิการ เปลือกต้น ตำพอกแผลสด ห้ามเลือด ราก เป็นยาถ่าย ไม่ระบุส่วนที่ใช้ ใช้แก้ไข้";
    }else if(filename == 'สะค้าน.jpg'){
        return "เถา รสเผ็ดร้อน ขับลมในลำไส้ แก้แน่น แก้จุกเสียด บำรุงธาตุ ทำให้ผายเรอ และใช้ปรุงยาธาตุ แก้ธาตุพิการ เป็นตัวยาประจำธาตุลม";
    }else if(filename == 'สารภีป่า.jpg'){
        return "เปลือก และดอก ใช้ถ่ายพยาธิ แก้บิด และแก้ไข้";
    }else if(filename == 'อบเชยไทย.jpg'){
        return "น้ำต้มเปลือกต้น ดื่มแก้ตับอักเสบ อาหารไม่ย่อย แก้ท้องเสีย ลำไส้เล็กทำงานผิดปกติ ขับพยาธิ มีสรรพคุณบำรุงดวงจิต  แก้อ่อนเพลีย  ชูกำลัง  ขับผายลม  บำรุงธาตุ  แก้บิด  แก้ลมอัณฑพฤกษ์   แก้ไข้สันนิบาต"
        +"ใช้ปรุงเป็นยานัตถุ์แก้ปวดหัว รับประทานแก้เบื่ออาหาร  แก้จุกเสียด แน่นท้อง อาหารไม่ย่อย  แก้ไอ  แก้ไข้หวัด  ลำไส้อักเสบ  ท้องเสียในเด็ก  อาการหวัด  ปวดปะจำเดือน แก้อ่อนเพลีย  คลื่นไส้อาเจียน  แก้ปวดประจำเดือน"
        +"ห้ามเลือด บดเป็นผงโรยแผลกามโรค สมานแผล";
    }else if(filename == 'เฉียงพร้านางแอ.jpg'){
        return "ใช้ ลำต้น ฝนน้ำกินแก้ไข้ ต้มน้ำดื่มบำรุงร่างกาย เป็นยาเจริญอาหารสำหรับสตรีหลังคลอด ผสมลำต้นแคด เปลือกต้นตับเต่าต้น ต้มน้ำดื่ม แก้ผิดสำแดง"
        +"เปลือกต้น ต้มน้ำอาบรักษาไข้ตัวร้อน แก่นช่วยขับลม ระบายความร้อน แก่น ใช้ทำเครื่องจักสาน";
    }else if(filename == 'เถาเอ็นอ่อน.jpg'){
        return "ใช้ เถา ต้มดื่มบำรุงเส้นเอ็นให้แข็งแรง แก้เส้นเอ็นพิการ เส้นแข็ง แก้ปวดเมื่อยเส้นเอ็น แก้ขัดยอก ทำให้คลายการตึงตัวเป็นสมุนไพรที่มีการนำมาใช้ในสูตรยาอบสมุนไพรเพื่อสุขภาพ"
        +"โดยใช้เป็นส่วนประกอบเพิ่มเติมจากสูตรยาอบสมุนไพรหลัก เมื่อต้องการอบเพื่อรักษาอาการปวดเมื่อย ปวดหลัง ปวดเอว เป็นต้น";
    }else if(filename == 'เปราะหอม.jpg'){
        return "ใช้ หัวใต้ดิน รสเผ็ดขม สุมศรีษะเด็ก แก้หวัดคัดจมูก รับประทานขับลมในลำไส้ แก้เสมหะ เจริญไฟธาตุ แก้ลงท้อง แก้โลหิตซึ่งเจือด้วยลมพิษ";
    }
}
function creditt(file){
    const filename = file.split('/').pop();
    if (filename=='ถั่วดินโคก.jpg') {
        return "https://herbs-in-manman.blogspot.com/ถั่วดินโคก";
    }else if (filename=='เทพทาโร.jpg') {
        return "http://clgc.agri.kps.ku.ac.th/resources/new-fragrant/cinnamomum.html";
    }else if (filename=='มะตูมนิ่ม.jpg') {
        return "https://www.technologychaoban.com/bullet-news-today/article_249780";
    }else if (filename=='มะหาด.jpg') {
        return "https://apps.phar.ubu.ac.th/phargarden/main.php?action=viewpage&pid=187";
    }else if (filename=='เร่ว.jpg') {
        return "https://apps.phar.ubu.ac.th/thaicrudedrug/main.php?action=viewpage&pid=117";
    }else if (filename=='หัวร้อยรู.jpg') {
        return "https://apps.phar.ubu.ac.th/thaicrudedrug/main.php?action=viewpage&pid=148";
    }else if (filename=='กระทุ่มนา.jpg') {
        return "http://clgc.agri.kps.ku.ac.th/resources/old-fragrant/mitragyna.html";
    }else if (filename=='ขันทองพยาบาท.jpg') {
        return "https://apps.phar.ubu.ac.th/phargarden/main.php?action=viewpage&pid=206";
    }else if (filename=='จุกโรหินี.jpg') {
        return "https://apps.phar.ubu.ac.th/thaicrudedrug/main.php?action=viewpage&pid=75";
    }else if (filename=='ชะเอมไทย.jpg') {
        return "https://apps.phar.ubu.ac.th/phargarden/main.php?action=viewpage&pid=41";
    }else if (filename=='ชิงชี่.jpg') {
        return "https://apps.phar.ubu.ac.th/phargarden/main.php?action=viewpage&pid=222";
    }else if (filename=='ตับเต่า.jpg') {
        return "https://thai-herbs.thdata.co/page/ตับเต่าใหญ่/";
    }else if (filename=='นางเเย้มป่า.jpg') {
        return "https://www.disthai.com/17198506/นางเเย้มป่า";
    }else if (filename=='ปลาไหลเผือก.jpg') {
        return "https://apps.phar.ubu.ac.th/thaicrudedrug/main.php?action=viewpage&pid=82";
    }else if (filename=='พังคี.jpg') {
        return "https://apps.phar.ubu.ac.th/phargarden/main.php?action=viewpage&pid=36";
    }else if (filename=='มะคังแดง.jpg') {
        return "https://apps.phar.ubu.ac.th/phargarden/main.php?action=viewpage&pid=91";
    }else if (filename=='สะค้าน.jpg') {
        return "https://apps.phar.ubu.ac.th/thaicrudedrug/main.php?action=viewpage&pid=183";
    }else if (filename=='สารภีป่า.jpg') {
        return "https://apps.phar.ubu.ac.th/phargarden/main.php?action=viewpage&pid=293";
    }else if (filename=='อบเชยไทย.jpg') {
        return "https://apps.phar.ubu.ac.th/thaicrudedrug/main.php?action=viewpage&pid=149";
    }else if (filename=='เฉียงพร้านางแอ.jpg') {
        return "https://apps.phar.ubu.ac.th/phargarden/main.php?action=viewpage&pid=218";
    }else if (filename=='เถาเอ็นอ่อน.jpg') {
        return "https://apps.phar.ubu.ac.th/thaicrudedrug/main.php?action=viewpage&pid=64";
    }else if (filename=='เปราะหอม.jpg') {
        return "https://apps.phar.ubu.ac.th/thaicrudedrug/main.php?action=viewpage&pid=154";
    }
}
